Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateElementInFamily Property
 Can't create element in this family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateElementInFamily { get; }
Public Shared ReadOnly Property CannotCreateElementInFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateElementInFamily {
	FailureDefinitionId^ get ();
}
static member CannotCreateElementInFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace